Conf.Simple/src/Documents/SUI_ДокументОбмена/SUI_ДокументОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>SUI_ДокументОбмена</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.SUI_ДополнительныеРеквизитыДокументовОбмена</registerRecords>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Идентификатор Simple</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаОснования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Идентификатор Simple</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <comment>Идентификатор Simple</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакМаркировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.SUI_ТипыДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСостояния</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецСостояния</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <comment>Уникальный идентификатор строки</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>Ключ связи со строкой табличной части документа 1С</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакМаркировки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОбработки</name>
      <type>
        <types>EnumRef.SUI_СтатусыОбработкиСтрок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <comment>Уникальный идентификатор строки</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>Ключ связи со строкой табличной части документа 1С</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводства</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ГоденДо</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОбработки</name>
      <type>
        <types>EnumRef.SUI_СтатусыОбработкиСтрок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <comment>Уникальный идентификатор строки</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>Ключ связи со строкой табличной части документа 1С</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеШтрихкода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОбработки</name>
      <type>
        <types>EnumRef.SUI_СтатусыОбработкиСтрок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Conf.Simple/src/InformationRegisters/SUI_ПотокШтрихкодов/SUI_ПотокШтрихкодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ПотокШтрихкодов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>МеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументОбмена</name>
    <type>
      <types>DocumentRef.SUI_ДокументОбмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_ТипыТаблицДокументовОбмена/SUI_ТипыТаблицДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыТаблицДокументовОбмена</name>
  <enumValues>
    <name>Отбор</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>ПотокШтрихкодов</name>
  </enumValues>
  <enumValues>
    <name>Серии</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Enums/SUI_ТипыДокументовОбмена/SUI_ТипыДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыДокументовОбмена</name>
  <enumValues>
    <name>Документ</name>
  </enumValues>
  <enumValues>
    <name>АдресноеХранениеОтбор</name>
  </enumValues>
  <enumValues>
    <name>АдресноеХранениеРазмещение</name>
  </enumValues>
  <enumValues>
    <name>СборШтрихкодов</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Enums/SUI_СтатусыОбработкиСтрок/SUI_СтатусыОбработкиСтрок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_СтатусыОбработкиСтрок</name>
  <enumValues>
    <name>ТребуетсяОбработка</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаНеВыполнена</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаНеТребуется</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Documents/SUI_ДокументОбмена/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		ПодгрузитьСсылкиРеквизитовИдентификаторов();
		
	КонецЕсли;
	
	ДополнительныеРеквизиты.Параметры.УстановитьЗначениеПараметра("Регистратор", Объект.Ссылка);
	Элементы.ГруппаДополнительныеРеквизиты.Видимость = Элементы.ФормаОтобразитьДополнительныеРеквизиты.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДоступностьИВидимостьЭлементов();
	
	ОбновитьВидимостьСтраниц();
	
	ОтборДополнительныхРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьОбъекта_SUI_НастройкиДокументовОбмена" Тогда
		ОбновитьВидимостьСтраниц();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗагруженныеИдентификаторыГрупповогоПересчета.Количество() > 0 Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗагруженныеИдентификаторыГрупповогоПересчета", ЗагруженныеИдентификаторыГрупповогоПересчета);
	КонецЕсли;
	
	Если ЗагруженныеИдентификаторыПотокаШтрихкодов.Количество() > 0 Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗагруженныеИдентификаторыПотокаШтрихкодов", ЗагруженныеИдентификаторыПотокаШтрихкодов);
	КонецЕсли;
	
	Если Не ТекущийОбъект.Ссылка.Пустая() И 
		ТекущийОбъект.Состояние <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.Ссылка, "Состояние") Тогда
		Документы.SUI_ДокументОбмена.СменитьСостояниеДокументаОбмена(ТекущийОбъект, ТекущийОбъект.Состояние);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьДоступностьИВидимостьЭлементов();
	ОбновитьВидимостьСтраниц();
	ОтборДополнительныхРеквизитов();
	
	ЗагруженныеИдентификаторыГрупповогоПересчета.Очистить();
	ЗагруженныеИдентификаторыПотокаШтрихкодов.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПодгрузитьСсылкиРеквизитовИдентификаторов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокументОснованиеСсылкаПриИзменении(Элемент)
	
	Объект.ДокументОснование = ИдентификаторSimpleПоСсылке(ДокументОснованиеСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ОтборДополнительныхРеквизитов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительныеРеквизиты

&НаСервереБезКонтекста
Процедура ДополнительныеРеквизитыПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Отбор = Новый Структура("Таблица,ИдентификаторСтроки");
	
	Для Каждого ЭлементОтбора Из Настройки.Отбор.Элементы Цикл
		
		Если Отбор.Свойство(Строка(ЭлементОтбора.ЛевоеЗначение)) Тогда
			Отбор[Строка(ЭлементОтбора.ЛевоеЗначение)] = ЭлементОтбора.ПравоеЗначение;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из Строки Цикл
		
		Если Отбор.Таблица = Строка.Ключ.Таблица И Отбор.ИдентификаторСтроки = Строка.Ключ.ИдентификаторСтроки И
			Не ПустаяСтрока(Строка.Значение.Данные.ЗначениеРеквизита) Тогда
			Строка.Значение.Данные.ЗначениеРеквизита = ОбщегоНазначения.ЗначениеИзСтрокиXML(Строка.Значение.Данные.ЗначениеРеквизита);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	ОтборДополнительныхРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ЗаполнитьИдентификаторСтроки(Объект.Товары, Элемент, НоваяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСерии

&НаКлиенте
Процедура СерииПриАктивизацииСтроки(Элемент)
	
	ОтборДополнительныхРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура СерииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ЗаполнитьИдентификаторСтроки(Объект.Серии, Элемент, НоваяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШтрихкодыУпаковок

&НаКлиенте
Процедура ШтрихкодыУпаковокПриАктивизацииСтроки(Элемент)
	
	ОтборДополнительныхРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодыУпаковокПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ЗаполнитьИдентификаторСтроки(Объект.ШтрихкодыУпаковок, Элемент, НоваяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтобразитьДополнительныеРеквизиты(Команда)
	
	Элементы.ФормаОтобразитьДополнительныеРеквизиты.Пометка = Не Элементы.ФормаОтобразитьДополнительныеРеквизиты.Пометка;
	Элементы.ГруппаДополнительныеРеквизиты.Видимость = Элементы.ФормаОтобразитьДополнительныеРеквизиты.Пометка;
	
	ОтборДополнительныхРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработкуСтрок(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСерии Тогда
		ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Серии");
		ВыделенныеСтроки = Элементы.Серии.ВыделенныеСтроки;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаШтрихкодыУпаковок Тогда
		ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок");
		ВыделенныеСтроки = Элементы.ШтрихкодыУпаковок.ВыделенныеСтроки;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ВыполнитьОбработкуСтрокНаСервере(ТипТаблицы, ВыделенныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьГрупповойПересчетТоваров(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Перед загрузкой данных необходимо записать документ.'"), 15,
			НСтр("ru = 'Групповой пересчет'"));
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьГрупповойПересчетТоваровПодтверждение", ЭтотОбъект);
	ПоказатьВопрос(ОповещениеОЗавершении, НСтр("ru = 'Загрузить данные?'"), РежимДиалогаВопрос.ДаНет, , , 
	НСтр("ru = 'Групповой пересчет'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПотокШтрихкодов(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Перед загрузкой данных необходимо записать документ.'"), 15,
			НСтр("ru = 'Поток штрихкодов'"));
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьПотокШтрихкодовПодтверждение", ЭтотОбъект);
	ПоказатьВопрос(ОповещениеОЗавершении, НСтр("ru = 'Загрузить данные?'"), РежимДиалогаВопрос.ДаНет, , , 
	НСтр("ru = 'Поток штрихкодов'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьСлужебныеДанныеВТабличныхЧастях(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТовары Тогда
		Элементы.ТоварыОтобразитьСлужебныеДанныеВТабличныхЧастях.Пометка = Не Элементы.ТоварыОтобразитьСлужебныеДанныеВТабличныхЧастях.Пометка;
		ОтображатьСлужебныеДанныеТовары = Элементы.ТоварыОтобразитьСлужебныеДанныеВТабличныхЧастях.Пометка;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСерии Тогда
		Элементы.СерииОтобразитьСлужебныеДанныеВТабличныхЧастях.Пометка = Не Элементы.СерииОтобразитьСлужебныеДанныеВТабличныхЧастях.Пометка;
		ОтображатьСлужебныеДанныеСерии = Элементы.СерииОтобразитьСлужебныеДанныеВТабличныхЧастях.Пометка;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаШтрихкодыУпаковок Тогда
		Элементы.ШтрихкодыУпаковокОтобразитьСлужебныеДанныеВТабличныхЧастях.Пометка = Не Элементы.ШтрихкодыУпаковокОтобразитьСлужебныеДанныеВТабличныхЧастях.Пометка;
		ОтображатьСлужебныеДанныеШтрихкодыУпаковок = Элементы.ШтрихкодыУпаковокОтобразитьСлужебныеДанныеВТабличныхЧастях.Пометка;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодгрузитьСсылкиРеквизитовИдентификаторов()
	
	ДокументОснованиеСсылка = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(Объект.ДокументОснование);
	КонтрагентСсылка = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(Объект.Контрагент);
	СкладСсылка = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(Объект.Склад);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьИВидимостьЭлементов()
	
	Если Не Объект.Ссылка.Пустая() Тогда
		Элементы.НастройкаДокумента.ТолькоПросмотр = Истина;
		Элементы.ДокументОснованиеСсылка.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.SUI_ТипыДокументовОбмена.Документ") Тогда
		Элементы.ТоварыЯчейка.Видимость = Ложь;
	ИначеЕсли Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.SUI_ТипыДокументовОбмена.АдресноеХранениеОтбор") Или
		Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.SUI_ТипыДокументовОбмена.АдресноеХранениеОтбор") Тогда
		Элементы.ТоварыВидЦены.Видимость = Ложь;
		Элементы.ТоварыЦена.Видимость = Ложь;
	ИначеЕсли Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.SUI_ТипыДокументовОбмена.СборШтрихкодов") Тогда
		Элементы.ТоварыЯчейка.Видимость = Ложь;
		Элементы.ТоварыВидЦены.Видимость = Ложь;
		Элементы.ТоварыЦена.Видимость = Ложь;
		Элементы.ТоварыСтатусУказанияСерии.Видимость = Ложь;
		Элементы.ТоварыПризнакМаркировки.Видимость = Ложь;
		Элементы.ТоварыКоличествоПлан.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИдентификаторSimpleПоСсылке(Ссылка)
	Возврат SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(Ссылка);
КонецФункции

&НаКлиенте
Процедура ОтборДополнительныхРеквизитов()
	
	Если Не Элементы.ГруппаДополнительныеРеквизиты.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("Таблица,ИдентификаторСтроки");
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОсновное Тогда
		
		Отбор.Таблица = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.ПустаяСсылка");
		Отбор.ИдентификаторСтроки = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.ПустойУникальныйИдентификатор();
		
	Иначе
		
		Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТовары Тогда
			
			ТекДанные = Элементы.Товары.ТекущиеДанные;
			
			Если Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.SUI_ТипыДокументовОбмена.Документ") Или
				Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.SUI_ТипыДокументовОбмена.АдресноеХранениеОтбор") Или
				Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.SUI_ТипыДокументовОбмена.АдресноеХранениеРазмещение") Тогда
				Отбор.Таблица = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Товары");
			Иначе
				Отбор.Таблица = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.ПустаяСсылка");
				ТекДанные = Неопределено;
			КонецЕсли;
			
		ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСерии Тогда
			Отбор.Таблица = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Серии");
			ТекДанные = Элементы.Серии.ТекущиеДанные;
		ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаШтрихкодыУпаковок Тогда
			Отбор.Таблица = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок");
			ТекДанные = Элементы.ШтрихкодыУпаковок.ТекущиеДанные;
		Иначе
			Отбор.Таблица = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.ПустаяСсылка");
			ТекДанные = Неопределено;
		КонецЕсли;
		
		Если ТекДанные = Неопределено Тогда
			Отбор.ИдентификаторСтроки = Новый УникальныйИдентификатор();
		Иначе
			Отбор.ИдентификаторСтроки = ТекДанные.ИдентификаторСтроки;
		КонецЕсли;
		
	КонецЕсли;
	
	ДополнительныеРеквизиты.Отбор.Элементы.Очистить();
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ДополнительныеРеквизиты.Отбор, "Таблица", Отбор.Таблица);
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ДополнительныеРеквизиты.Отбор, "ИдентификаторСтроки", Отбор.ИдентификаторСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьСтраниц()
	
	НастроенныеТипыТаблиц = ПолучитьДоступныеНастроенныеТипыТаблиц(Объект.НастройкаДокумента, Объект.ТипДокумента);
	
	Если Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.SUI_ТипыДокументовОбмена.Документ") Тогда
		ТипТаблицыДляСтраницыТовары = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Товары");
	ИначеЕсли Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.SUI_ТипыДокументовОбмена.АдресноеХранениеОтбор") Тогда
		ТипТаблицыДляСтраницыТовары = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Отбор");
	ИначеЕсли Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.SUI_ТипыДокументовОбмена.АдресноеХранениеРазмещение") Тогда
		ТипТаблицыДляСтраницыТовары = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Размещение");
	ИначеЕсли Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.SUI_ТипыДокументовОбмена.СборШтрихкодов") Тогда
		ТипТаблицыДляСтраницыТовары = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.ПотокШтрихкодов");
	Иначе
		ТипТаблицыДляСтраницыТовары = Неопределено;
	КонецЕсли;
	
	Элементы.СтраницаТовары.Видимость = (НастроенныеТипыТаблиц.Найти(ТипТаблицыДляСтраницыТовары) <> Неопределено);
		
	Элементы.СтраницаСерии.Видимость = 
		(НастроенныеТипыТаблиц.Найти(ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Серии")) <> Неопределено);
		
	Элементы.СтраницаШтрихкодыУпаковок.Видимость = 
		(НастроенныеТипыТаблиц.Найти(ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок")) <> Неопределено);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДоступныеНастроенныеТипыТаблиц(НастройкаДокумента, ТипДокумента)
	
	Возврат Справочники.SUI_НастройкиДокументовОбмена.ПолучитьДоступныеНастроенныеТипыТаблиц(НастройкаДокумента, ТипДокумента);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьИдентификаторСтроки(ТабличнаяЧасть, Элемент, НоваяСтрока)
	
	Если НоваяСтрока И Элемент.ТекущиеДанные <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ИдентификаторСтроки) Тогда
			
			Если Объект.Товары.НайтиСтроки(Новый Структура("ИдентификаторСтроки", Элемент.ТекущиеДанные.ИдентификаторСтроки)).Количество() > 1 Тогда
				Элемент.ТекущиеДанные.ИдентификаторСтроки = SUI_ДокументыОбменаКлиентСервер
					.СформироватьИдентификаторСтрокиТабличнойЧастиДокументаОбмена(ТабличнаяЧасть);
			КонецЕсли;
			
		Иначе
			Элемент.ТекущиеДанные.ИдентификаторСтроки = SUI_ДокументыОбменаКлиентСервер
				.СформироватьИдентификаторСтрокиТабличнойЧастиДокументаОбмена(ТабличнаяЧасть);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработкуСтрокНаСервере(ТипТаблицы, ВыделенныеСтроки)
	
	СтрокиОбработаны = Ложь;
	
	Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии Тогда
		
		СтрокиКОбработке = Новый Массив();
		Для индекс = 0 По ВыделенныеСтроки.ВГраница() Цикл
			СтрокаКОбработке = Объект.Серии.НайтиПоИдентификатору(ВыделенныеСтроки[индекс]);
			Если СтрокаКОбработке <> Неопределено Тогда
				СтрокиКОбработке.Добавить(СтрокаКОбработке);
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокиКОбработке.Количество() > 0 Тогда
			Документы.SUI_ДокументОбмена.ОбработатьСтрокиСерий(СтрокиКОбработке, СтрокиОбработаны);
		КонецЕсли;
		
	ИначеЕсли ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок Тогда
		
		СтрокиКОбработке = Новый Массив();
		Для индекс = 0 По ВыделенныеСтроки.ВГраница() Цикл
			СтрокаКОбработке = Объект.ШтрихкодыУпаковок.НайтиПоИдентификатору(ВыделенныеСтроки[индекс]);
			Если СтрокаКОбработке <> Неопределено Тогда
				СтрокиКОбработке.Добавить(СтрокаКОбработке);
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокиКОбработке.Количество() > 0 Тогда
			Документы.SUI_ДокументОбмена.ОбработатьСтрокиШтрихкодовУпаковок(СтрокиКОбработке, СтрокиОбработаны);
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтрокиОбработаны Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьГрупповойПересчетТоваровПодтверждение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ЗагрузитьГрупповойПересчетТоваровНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьГрупповойПересчетТоваровНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	Если ДокументОбъект.ЗагрузитьГрупповойПересчет(ЗагруженныеИдентификаторыГрупповогоПересчета) Тогда
		Модифицированность = Истина;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Загрузка данных групповго пересчета завершена.'"));
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПотокШтрихкодовПодтверждение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗагрузки = Новый Структура();
	ПараметрыЗагрузки.Вставить("ДокументОбмена", Объект.Ссылка);
	ПараметрыЗагрузки.Вставить("ИдентификаторВладельца", УникальныйИдентификатор);
	ПараметрыЗагрузки.Вставить("ЗаголовокКнопкиВыбор", НСтр("ru = 'Загрузить выбранные'"));
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьПотокШтрихкодовОбработкаВыбора", ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.SUI_ПотокШтрихкодов.Форма.ФормаПотокШтрихкодов", ПараметрыЗагрузки, ЭтотОбъект, 
		УникальныйИдентификатор, Окно, , ОповещениеОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПотокШтрихкодовОбработкаВыбора(АдресРезультата, ДополнительныеПараметры) Экспорт
	
	Если АдресРезультата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьПотокШтрихкодовОбработкаВыбораНаСервере(АдресРезультата);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПотокШтрихкодовОбработкаВыбораНаСервере(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Для Каждого СтрокаРезультат Из Результат Цикл
		
		Данные = Новый Структура("Номенклатура,Характеристика,Упаковка");
		ЗаполнитьЗначенияСвойств(Данные, СтрокаРезультат);
		
		SUI_ИнтеграцияВКонфигурацию.ПривестиСсылкиКИдентификаторамSimple(Данные);
		
		НайденныеСтроки = Объект.Товары.НайтиСтроки(Данные);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			НайденныеСтроки.Добавить(Объект.Товары.Добавить());
			ЗаполнитьЗначенияСвойств(НайденныеСтроки[0], Данные);
			НайденныеСтроки[0].ИдентификаторСтроки = SUI_ДокументыОбменаКлиентСервер
				.СформироватьИдентификаторСтрокиТабличнойЧастиДокументаОбмена(Объект.Товары);
			НайденныеСтроки[0].СтатусОбработки = Перечисления.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется;
		КонецЕсли;
		
		НайденныеСтроки[0].КоличествоФакт = НайденныеСтроки[0].КоличествоФакт + СтрокаРезультат.Количество;
		
		Для Каждого ИдентификаторЗаписи Из СтрокаРезультат.ИдентификаторЗаписи Цикл
			ЗагруженныеИдентификаторыПотокаШтрихкодов.Добавить(ИдентификаторЗаписи.Значение);
		КонецЦикла;
		
		Модифицированность = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
